Core/src/Documents/КомплектацияВА/КомплектацияВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплектацияВА</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.СостоянияВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКомплектацииВА</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписанияВА</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСписывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПослеПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияПослеПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяцПослеПровледения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеВА</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстаточнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДекомплектующиеВА</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеВА</name>
      <type>
        <types>EnumRef.СостоянияВнеоборотныхАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийКомплектацииВА/ВидыОперацийКомплектацииВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКомплектацииВА</name>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектация</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СостоянияВнеоборотныхАктивов/СостоянияВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВнеоборотныхАктивов</name>
  <enumValues>
    <name>ПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятСУчета</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/КомплектацияВА/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКомплектацияВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	КомплектацияВА.Ссылка,
	|	КомплектацияВА.ВерсияДанных,
	|	КомплектацияВА.ПометкаУдаления,
	|	КомплектацияВА.Номер,
	|	КомплектацияВА.Дата,
	|	КомплектацияВА.Проведен,
	|	КомплектацияВА.Организация,
	|	КомплектацияВА.ВидОперации,
	|	КомплектацияВА.СчетСписанияВА,
	|	КомплектацияВА.Имущество КАК ВнеоборотныйАктив,
	|	КомплектацияВА.СтруктурнаяЕдиница,
	|	ВЫРАЗИТЬ(КомплектацияВА.Адрес КАК СТРОКА(250)) КАК Адрес,
	|	КомплектацияВА.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	КомплектацияВА.ПервоначальнаяСтоимость,
	|	КомплектацияВА.НачислятьАмортизациюВТекущемМесяце,
	|	КомплектацияВА.СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА КомплектацияВА.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|			ТОГДА КомплектацияВА.СчетЗатрат.СчетАналогУУ
	|		ИНАЧЕ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл.СчетАналогУУ
	|	КОНЕЦ КАК СчетЗатрат,
	|	ВЫБОР
	|		КОГДА КомплектацияВА.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|			ТОГДА КомплектацияВА.СчетЗатрат
	|		ИНАЧЕ ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл
	|	КОНЕЦ КАК СчетЗатратРегл,
	|	КомплектацияВА.НаправлениеДеятельности,
	|	КомплектацияВА.СтоимостьДляВычисленияАмортизации,
	|	КомплектацияВА.Автор,
	|	&ВалютаУчета КАК Валюта,
	|	КомплектацияВА.Ответственный,
	|	КомплектацияВА.Комментарий,
	|	КомплектацияВА.НачислятьАмортизацию,
	|	КомплектацияВА.ЗапретРедактированияДокументов,
	|	КомплектацияВА.НеСписывать,
	|	КомплектацияВА.Стоимость,
	|	КомплектацияВА.ОстаточнаяСтоимость,
	|	КомплектацияВА.Амортизация,
	|	КомплектацияВА.АмортизацияЗаМесяц,
	|	КомплектацияВА.ДоляСтоимости,
	|	КомплектацияВА.СтоимостьПослеПроведения,
	|	КомплектацияВА.АмортизацияПослеПроведения,
	|	КомплектацияВА.АмортизацияЗаМесяцПослеПровледения
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.КомплектацияВА КАК КомплектацияВА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, ) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО КомплектацияВА.Имущество = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|			И КомплектацияВА.Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация
	|ГДЕ
	|	КомплектацияВА.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектацияВАКомплектующиеВА.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	КомплектацияВАКомплектующиеВА.Ссылка КАК Ссылка,
	|	КомплектацияВАКомплектующиеВА.НомерСтроки КАК НомерСтроки,
	|	КомплектацияВАКомплектующиеВА.Ссылка.Дата КАК Дата,
	|	КомплектацияВАКомплектующиеВА.Ссылка.Организация КАК ОРганизация,
	|	КомплектацияВАКомплектующиеВА.Ссылка.ВидОперации КАК ВидОперации,
	|	КомплектацияВАКомплектующиеВА.Ссылка.СчетЗатрат КАК СчетЗатрат,
	|	КомплектацияВАКомплектующиеВА.Ссылка.СчетСписанияВА КАК СчетСписанияВА,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	&ВалютаУчета КАК Валюта,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности,
	|	СУММА(КомплектацияВАКомплектующиеВА.Стоимость) КАК ТекСтоимость,
	|	СУММА(КомплектацияВАКомплектующиеВА.Амортизация) КАК НакопленнаяАмортизация,
	|	СУММА(КомплектацияВАКомплектующиеВА.ОстаточнаяСтоимость) КАК ОстаточнаяСтоимость,
	|	СУММА(КомплектацияВАКомплектующиеВА.АмортизацияЗаМесяц) КАК АмортизацияЗаМесяц
	|ПОМЕСТИТЬ ВременнаяТаблицаКомплектующиеОС
	|ИЗ
	|	Документ.КомплектацияВА.КомплектующиеВА КАК КомплектацияВАКомплектующиеВА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&МоментВремени, Регистратор <> &Ссылка) КАК ПараметрыВнеоборотныхАктивовСрезПоследних
	|		ПО КомплектацияВАКомплектующиеВА.ВнеоборотныйАктив = ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
	|			И КомплектацияВАКомплектующиеВА.Ссылка.Организация = ПараметрыВнеоборотныхАктивовСрезПоследних.Организация
	|ГДЕ
	|	КомплектацияВАКомплектующиеВА.Ссылка = &Ссылка
	|	И КомплектацияВАКомплектующиеВА.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияВАКомплектующиеВА.ВнеоборотныйАктив,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница,
	|	КомплектацияВАКомплектующиеВА.Ссылка,
	|	ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности,
	|	КомплектацияВАКомплектующиеВА.НомерСтроки,
	|	КомплектацияВАКомплектующиеВА.Ссылка.Дата,
	|	КомплектацияВАКомплектующиеВА.Ссылка.Организация,
	|	КомплектацияВАКомплектующиеВА.Ссылка.ВидОперации,
	|	КомплектацияВАКомплектующиеВА.Ссылка.СчетЗатрат,
	|	КомплектацияВАКомплектующиеВА.Ссылка.СчетСписанияВА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектацияВАДекомплектующиеВА.ВнеоборотныйАктив,
	|	&ВалютаУчета КАК Валюта,
	|	КомплектацияВАДекомплектующиеВА.Ссылка,
	|	КомплектацияВАДекомплектующиеВА.НомерСтроки,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.Организация,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.Дата,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.СчетСписанияВА,
	|	КомплектацияВАДекомплектующиеВА.СтруктурнаяЕдиница,
	|	КомплектацияВАДекомплектующиеВА.ДоляСтоимости,
	|	КомплектацияВАДекомплектующиеВА.СостояниеВА,
	|	КомплектацияВАДекомплектующиеВА.СрокИспользованияДляВычисленияАмортизации,
	|	КомплектацияВАДекомплектующиеВА.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	КомплектацияВАДекомплектующиеВА.Выработка,
	|	КомплектацияВАДекомплектующиеВА.ПервоначальнаяСтоимость,
	|	КомплектацияВАДекомплектующиеВА.НачислятьАмортизацию,
	|	КомплектацияВАДекомплектующиеВА.Амортизация,
	|	КомплектацияВАДекомплектующиеВА.НачислятьАмортизациюВТекущемМесяце,
	|	КомплектацияВАДекомплектующиеВА.СчетЗатрат КАК СчетЗатрат,
	|	КомплектацияВАДекомплектующиеВА.СчетЗатратРегл КАК СчетЗатратРегл,
	|	КомплектацияВАДекомплектующиеВА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(КомплектацияВАДекомплектующиеВА.Адрес КАК СТРОКА(250)) КАК Адрес,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.ВидОперации КАК ВидОперации,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.Имущество КАК СписуемоеВА,
	|	КомплектацияВАДекомплектующиеВА.Ссылка.СтруктурнаяЕдиница КАК СписуемаяСтруктурнаяЕдиница,
	|	КомплектацияВАДекомплектующиеВА.АмортизацияЗаМесяц
	|ПОМЕСТИТЬ ВременнаяТаблицаДеукомплектация
	|ИЗ
	|	Документ.КомплектацияВА.ДекомплектующиеВА КАК КомплектацияВАДекомплектующиеВА
	|ГДЕ
	|	КомплектацияВАДекомплектующиеВА.Ссылка = &Ссылка
	|	И КомплектацияВАДекомплектующиеВА.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаЗапасы(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства);
	СформироватьПараметрыВнеоборотныхАктивов(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства);
	СформироватьСостоянияВнеоборотныхАктивов(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_КомплектацияВА(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства);	

КонецПроцедуры

Процедура СформироватьТаблицаЗапасы(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.СчетЗатрат.СчетАналогУУ КАК СчетУчета,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетУчетаРегл,
	|	NULL КАК Номенклатура,
	|	NULL КАК Характеристика,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	ЛОЖЬ КАК ЗатратыНаВыпуск,
	|	ЛОЖЬ КАК Возврат,
	|	ЛОЖЬ КАК ПеремещениеВРозницуСуммовойУчет,
	|	&ОприходованиеЗапасов КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.СписаниеВА) КАК ХозяйственнаяОперация,
	|	0 КАК Количество,
	|	СУММА(ТаблицаДокумента.НакопленнаяАмортизация) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.НакопленнаяАмортизация > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетЗатрат.СчетАналогУУ,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	NULL,
	|	NULL,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	&ОприходованиеЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.СписаниеВА),
	|	0,
	|	СУММА((ТаблицаДокумента.АмортизацияПослеПроведения - ТаблицаДокумента.АмортизацияЗаМесяц - ТаблицаДокумента.Амортизация) * (-1))
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.АмортизацияПослеПроведения - ТаблицаДокумента.АмортизацияЗаМесяц - ТаблицаДокумента.Амортизация <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='ამორტიზაციის საფასური';ru='Начисление амортизации';en='depreciation is calculated'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьПараметрыВнеоборотныхАктивов(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	СУММА(ТаблицаСумм.ТекСтоимость) КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Адрес КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента,
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.Адрес,
	|	ТаблицаДокумента.НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	СУММА(ТаблицаДокумента.ПервоначальнаяСтоимость),
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности,
	|	ТаблицаДокумента.Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл
	|ИЗ
	|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.Адрес,
	|	ТаблицаДокумента.НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='ამორტიზაციის საფასური';ru='Начисление амортизации';en='depreciation is calculated'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет) КАК ВидДвиженияУправленческий,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетУчета,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетУчетаРегл,
	|	СУММА(ТаблицаСумм.ТекСтоимость) КАК Стоимость,
	|	0 КАК Амортизация,
	|	&ПринятиеВнеоборотногоАктиваКУчету КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента,
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	|ГДЕ
	|	ТаблицаСумм.ТекСтоимость > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаСумм.НакопленнаяАмортизация),
	|	&НачислениеАмортизации
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента,
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	|ГДЕ
	|	ТаблицаСумм.НакопленнаяАмортизация > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаСумм.Организация,
	|	ТаблицаСумм.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаСумм.НакопленнаяАмортизация),
	|	&СписаниеАмортизации
	|ИЗ
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ПО ТаблицаСумм.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаСумм.НакопленнаяАмортизация > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаСумм.Организация,
	|	ТаблицаСумм.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	2.1,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл,
	//|	0,
	//|	СУММА(ТаблицаСумм.АмортизацияЗаМесяц),
	//|	&НачислениеАмортизации
	//|ИЗ
	//|	ВременнаяТаблицаШапка КАК ТаблицаДокумента,
	//|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	//|ГДЕ
	//|	ТаблицаСумм.АмортизацияЗаМесяц > 0
	//|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	3.1,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	//|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	//|	ТаблицаСумм.Организация,
	//|	ТаблицаСумм.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл,
	//|	0,
	//|	СУММА(ТаблицаСумм.АмортизацияЗаМесяц),
	//|	&СписаниеАмортизации
	//|ИЗ
	//|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ТаблицаДокумента
	//|		ПО ТаблицаСумм.Ссылка = ТаблицаДокумента.Ссылка
	//|ГДЕ
	//|	ТаблицаСумм.АмортизацияЗаМесяц > 0
	//|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаСумм.Организация,
	//|	ТаблицаСумм.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаСумм.Организация,
	|	ТаблицаСумм.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	СУММА(ТаблицаСумм.ТекСтоимость),
	|	0,
	|	&СписаниеВА
	|ИЗ
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаСумм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ПО ТаблицаСумм.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаСумм.ТекСтоимость > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаСумм.Организация,
	|	ТаблицаСумм.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	СУММА(ТаблицаДокумента.ПервоначальнаяСтоимость),
	|	0,
	|	&ПринятиеВнеоборотногоАктиваКУчету
	|ИЗ
	|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ПервоначальнаяСтоимость > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаДокумента.Амортизация),
	|	&НачислениеАмортизации
	|ИЗ
	|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Амортизация > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаДокумента.Амортизация - ТаблицаДокумента.АмортизацияПослеПроведения),
	|	&СписаниеАмортизации
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Амортизация - ТаблицаДокумента.АмортизацияПослеПроведения > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6.1,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаДокумента.АмортизацияЗаМесяц),
	|	&НачислениеАмортизации
	|ИЗ
	|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.АмортизацияЗаМесяц > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7.1,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаДокумента.АмортизацияЗаМесяц - ТаблицаДокумента.АмортизацияПослеПроведения),
	|	&СписаниеАмортизации
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Амортизация - ТаблицаДокумента.АмортизацияПослеПроведения > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	6.2,
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	//|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет),
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл,
	//|	0,
	//|	СУММА(ТаблицаДокумента.АмортизацияЗаМесяц),
	//|	&НачислениеАмортизации
	//|ИЗ
	//|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.АмортизацияЗаМесяц > 0
	//|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаДокумента.НомерСтроки,
	//|	ТаблицаДокумента.Дата,
	//|	ТаблицаДокумента.Организация,
	//|	ТаблицаДокумента.ВнеоборотныйАктив,
	//|	ТаблицаДокумента.СчетЗатрат,
	//|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7.2,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	0,
	|	СУММА(ТаблицаДокумента.АмортизацияЗаМесяц - ТаблицаДокумента.АмортизацияПослеПроведения),
	|	&СписаниеАмортизации
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Амортизация - ТаблицаДокумента.АмортизацияПослеПроведения > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл,
	|	СУММА(ТаблицаДокумента.Стоимость - СтоимостьПослеПроведения),
	|	0,
	|	&СписаниеВА
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Стоимость - ТаблицаДокумента.СтоимостьПослеПроведения > 0
	|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатрат,
	|	ТаблицаДокумента.СчетЗатратРегл
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПринятиеВнеоборотногоАктиваКУчету", НСтр("ka='ძ/ს აღრიცხვაზე აყვანა';ru='Принятие к учету имущества';en='Acceptance for accounting assets'"));
	Запрос.УстановитьПараметр("НачислениеАмортизации", НСтр("ka='ამორტიზაციის დარიცხვა';ru='Начисление амортизации';en='depreciation is calculated'"));
	Запрос.УстановитьПараметр("СписаниеАмортизации", НСтр("ka='ამორტიზაციის ჩამოწერა';ru='Спиание амортизации';en='depreciation Spianie'"));
	Запрос.УстановитьПараметр("СписаниеВА", НСтр("ka='ძ/ს ჩამოწერა';ru='Списание имущества с учета';en='Write-off of property with accounting'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВнеоборотныеАктивы", РезультатЗапроса.Выгрузить());	

КонецПроцедуры

Процедура СформироватьСостоянияВнеоборотныхАктивов(ДокументСсылкаКомплектацияВА, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.СнятСУчета) КАК Состояние,
	|	ЛОЖЬ КАК НачислятьАмортизацию,
	|	ЛОЖЬ КАК НачислятьАмортизациюВТекущемМесяце
	|ИЗ
	|	ВременнаяТаблицаКомплектующиеОС КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету),
	|	ТаблицаДокумента.НачислятьАмортизацию,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Комплектация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.СнятСУчета),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|	И НЕ ТаблицаДокумента.НеСписывать
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4 КАК Порядок,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету),
	|	ТаблицаДокумента.НачислятьАмортизацию,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце
	|ИЗ
	|	ВременнаяТаблицаДеукомплектация КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацииВА.Разукомплектация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ka='ამორტიზაციის საფასური';ru='Начисление амортизации';en='depreciation is calculated'"));
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянияВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());	

КонецПроцедуры
